Repository: PathGao/Nifro
Catalog: Nifro/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ copy
zh_hans: %@ 副本

# %@× at %lld%%, %lld%%
source: %1$@× at %2$lld%%, %3$lld%%
zh_hans: %@× 位于 %lld%%, %lld%%

source: Wallpaper-ready pages with their recommended settings.
zh_hans: 适合做壁纸的网页，已附带推荐设置。

source: A page that needs a resolution can take “[[screenWidth]]” and “[[screenHeight]]” in the address, which Nifro replaces with the wallpaper's size on that display.
zh_hans: 需要分辨率的页面可以在地址里写「[[screenWidth]]」和「[[screenHeight]]」，Nifro 会把它们替换成壁纸在那块屏幕上的尺寸。

source: Scheduled reloads return a page to the start. Turn this on to restore its previous position.
zh_hans: 定时刷新会让页面回到开头。开启后，Nifro 会恢复刷新前的位置。

source: Action
zh_hans: 操作

source: Actual Size
zh_hans: 实际大小

source: Add
zh_hans: 添加

source: Add ${url} to Nifro
zh_hans: 把 ${url} 添加到 Nifro

source: Add Playlist
zh_hans: 添加播放列表

source: Add Website
zh_hans: 添加网站

source: Add Website…
zh_hans: 添加网站…

source: Add the Default Playlist
zh_hans: 添加默认播放列表

source: Add the default playlist?
zh_hans: 要添加默认播放列表吗？

source: Add website
zh_hans: 添加网站

source: Added
zh_hans: 已添加

source: Added Website
zh_hans: 已添加的网站

source: Added to your playlists
zh_hans: 已添加到你的播放列表

source: Adds a website to Nifro. Returns the added website.
zh_hans: 向 Nifro 添加一个网站。 返回添加的网站。

source: Advanced
zh_hans: 高级

source: All
zh_hans: 全部

source: Allow
zh_hans: 允许

source: Allow self-signed certificate
zh_hans: 允许自签名证书

source: Always
zh_hans: 总是

source: Audio
zh_hans: 声音

source: Behavior
zh_hans: 行为

source: Bind to Display
zh_hans: 与显示器绑定

source: Blocking
zh_hans: 正在拦截

source: Browsing Mode
zh_hans: 浏览模式

source: Browsing Mode — hold to use, tap to toggle
zh_hans: 浏览模式：按住时使用，轻按切换

source: CSS and JavaScript…
zh_hans: CSS 与 JavaScript…

source: Cancel
zh_hans: 取消

source: Check Now
zh_hans: 立即检查

source: Check for updates automatically
zh_hans: 自动检查更新

source: Checking for new entries…
zh_hans: 正在检查新条目…

source: Checks once a day in the background and puts a download button in the panel when there is something newer; nothing is ever downloaded or installed for you.
zh_hans: 每天在后台检查一次，有更新时在面板里放一个下载按钮；从不替你下载或安装任何东西。

source: Choose
zh_hans: 选择

source: Choose Local Website
zh_hans: 选择本地网页

source: Choose a directory with a “index.html” file.
zh_hans: 选择一个含有「index.html」文件的目录。

source: Choose region
zh_hans: 选择区域

source: Clear All Website Data
zh_hans: 清除所有网站数据

source: Clear Data
zh_hans: 清除数据

source: Clear all website data?
zh_hans: 要清除所有网站数据吗？

source: Content blocking rules
zh_hans: 内容拦截规则

source: Continue
zh_hans: 继续

source: Copies this website's settings as text for pasting into an issue, reporting the CSS and JavaScript by size rather than by content.
zh_hans: 把这个网站的设置复制成文本，方便粘进 issue；CSS 和 JavaScript 只报大小，不报内容。

source: Copy Settings
zh_hans: 复制设置

source: Couldn't check for updates
zh_hans: 无法检查更新

source: Could not download
zh_hans: 无法下载

source: Crop
zh_hans: 裁切

source: Current Website
zh_hans: 当前网站

source: Custom code
zh_hans: 自定义代码

source: Turn off wallpapers on battery
zh_hans: 使用电池时关闭壁纸

source: Default Playlist
zh_hans: 默认播放列表

source: Delete
zh_hans: 删除

source: Delete %@?
zh_hans: 删除「%@」？

source: Deletes every playlist and every website, along with their cookies, caches, thumbnails and each page's remembered position and zoom.
zh_hans: 删除每个播放列表和每个网站，连同它们的 Cookie、缓存、缩略图，以及每个页面记住的位置和缩放。

source: Delete…
zh_hans: 删除…

source: Dim while another app is in front
zh_hans: 其他应用在前时变暗

source: Dimmed to
zh_hans: 变暗到

source: Don't Keep
zh_hans: 不保留

source: Done
zh_hans: 完成

source: Double-click a website in the list to edit it, toggle dark mode, add custom CSS/JavaScript, and more.
zh_hans: 在列表里双击一个网站即可编辑：切换深色模式、加自定义 CSS/JavaScript，等等。

source: Drag or scroll to move the frame · pinch to resize · Return to keep · Esc to cancel
zh_hans: 拖动或滚动移动取景框 · 捏合改大小 · 回车保留 · Esc 取消

source: Duplicate
zh_hans: 复制

source: Duplicate %@?
zh_hans: 复制「%@」？

source: Duplicate…
zh_hans: 复制…

source: Edit
zh_hans: 编辑

source: Edit…
zh_hans: 编辑…

source: Enabled State
zh_hans: 启用状态

source: Error: %@
zh_hans: 出错：%@

source: Every playlist and every website goes, along with the custom CSS, JavaScript, regions and schedules written for them. You will be signed out of every site, and there is no undo. Add the Default Playlist puts the websites Nifro comes with back.
zh_hans: 每个播放列表和每个网站都会消失，为它们写的自定义 CSS、JavaScript、缩放区域和排期也一样。你会从每个网站退出登录，而且无法撤销。 「添加默认播放列表」会把 Nifro 自带的网站放回来。

source: Every website in it goes with it, along with the custom CSS, JavaScript, regions and schedules written for them; you will be signed out of each of those sites, and there is no undo.
zh_hans: 里面的每个网站都会一起消失，为它们写的自定义 CSS、JavaScript、缩放区域和排期也一样；你会从这些网站逐一退出登录，而且无法撤销。

source: External links
zh_hans: 外部链接

source: Fades the wallpaper back while you work elsewhere, and brings it up again when you click the desktop.
zh_hans: 你在别处工作时让壁纸淡下去，点桌面时再亮回来。

source: Feedback Welcome
zh_hans: 欢迎反馈

source: Follow Settings
zh_hans: 跟随设置

source: Used by websites without their own reload schedule. A website-specific setting overrides this one.
zh_hans: 用于未设置自己刷新计划的网站；网站自己的设置会覆盖这里。

source: Keep Browsing Mode in front
zh_hans: 浏览模式保持在最前

source: Forces the website's print styles (“@media print”) if it has any, which are often simpler.
zh_hans: 强制使用网站的打印样式（「@media print」），如果有的话——它通常更简洁。

source: Fullscreen compatibility mode
zh_hans: 全屏兼容模式

source: Freed %@
zh_hans: 已释放 %@

source: From
zh_hans: 从

source: General
zh_hans: 通用

source: Get %@…
zh_hans: 获取 %@…

source: Get Current Website
zh_hans: 获取当前网站

source: Get Enabled State
zh_hans: 获取启用状态

source: Get Started with Nifro
zh_hans: 开始使用 Nifro

source: Get the current enabled state of Nifro
zh_hans: 获取 Nifro 当前的启用状态

source: GitHub
zh_hans: GitHub 仓库

source: Hide menu bar icon
zh_hans: 隐藏菜单栏图标

source: Use a separate reload interval for this page. When off, it follows the interval in Settings.
zh_hans: 为此页面设置单独的刷新间隔。关闭后，它会使用“设置”中的全局间隔。

source: How see-through the wallpaper is against the desktop behind it; Browsing Mode always draws it fully opaque.
zh_hans: 壁纸相对于背后桌面的透明程度；浏览模式下始终完全不透明。

source: If you cannot see the website, hide some windows to reveal the desktop.
zh_hans: 如果看不到网站，收起一些窗口把桌面露出来。

source: In Nifro
zh_hans: 在 Nifro 中

source: In the default browser
zh_hans: 在默认浏览器中

source: Incorrect directory.
zh_hans: 目录不对。

source: Inject your own CSS or JavaScript into this website. Most websites need neither.
zh_hans: 给这个网站注入你自己的 CSS 或 JavaScript。绝大多数网站两个都不需要。

source: Inspired by [Plash](https://github.com/sindresorhus/Plash) by Sindre Sorhus.
zh_hans: 灵感来自 Sindre Sorhus 的 [Plash](https://github.com/sindresorhus/Plash)。

source: Invalid URL for the “add” command.
zh_hans: 「add」命令的网址无效。

source: Invalid URL: %@
zh_hans: URL 无效：%@

source: Invert colors
zh_hans: 反转颜色

source: Inverts every colour on the website, as a fake dark mode for sites that have none.
zh_hans: 反转网站的全部颜色，给没有深色模式的网站做一个假的。

source: Is Current
zh_hans: 是当前网站

source: Is Enabled
zh_hans: 已启用

source: Its custom CSS, JavaScript, region and schedule go with it, you will be signed out of the site, and there is no undo.
zh_hans: 为它写的自定义 CSS、JavaScript、缩放区域和排期会一起消失，你会从这个网站退出登录，而且无法撤销。

source: Keep
zh_hans: 保留

source: Keep changes?
zh_hans: 保留更改吗？

source: Keep the website above all other windows while browsing mode is active.
zh_hans: 浏览模式期间让网站保持在所有窗口之上。

source: Language
zh_hans: 语言

source: Not Now
zh_hans: 稍后

source: Launch Nifro again to bring the menu bar icon back for 5 seconds.
zh_hans: 再次启动 Nifro，菜单栏图标会回来 5 秒。

source: Launch at login
zh_hans: 登录时启动

source: Lets you temporarily interact with the website, to log in or scroll to a particular place.
zh_hans: 让你临时操作网站，比如登录，或者滚到某个位置。

source: Lets web pages and video players use macOS fullscreen. Nifro appears in the Dock while this mode is on. Reopen Nifro after changing this setting.
zh_hans: 允许网页和视频播放器使用 macOS 全屏。启用后，Nifro 会显示在程序坞中。更改此设置后，请重新打开 Nifro。

source: Load this page even if macOS does not trust its certificate. Use this only for devices on a trusted network.
zh_hans: 即使 macOS 不信任该证书，也加载此页面。仅应对受信任网络中的设备启用此选项。

source: Local Website…
zh_hans: 本地网页…

source: Log In
zh_hans: 登录

source: Log in to %@
zh_hans: 登录 %@

source: Main Display
zh_hans: 主显示器

source: Manage Websites…
zh_hans: 管理网站…

source: Update menu bar colour every
zh_hans: 菜单栏颜色更新间隔

source: Minutes between websites
zh_hans: 每隔多少分钟换一个网站

source: Browse more wallpaper ideas
zh_hans: 浏览更多壁纸灵感

source: More information
zh_hans: 更多说明

source: Muted
zh_hans: 静音

source: Name
zh_hans: 名称

source: Never
zh_hans: 从不

source: Next website
zh_hans: 下一个网站

source: Choose the language Nifro uses. Any untranslated text stays in English.
zh_hans: 选择 Nifro 使用的语言。尚未翻译的文字会继续显示为英文。

source: Nifro is off
zh_hans: Nifro 已关闭

source: Nifro is open source and its issue tracker is open. If something is broken, missing, or just annoying, the feedback button in the app goes straight there.
zh_hans: Nifro 是开源的，问题追踪也是公开的。有东西坏了、缺了，或者只是用着别扭，app 里的反馈按钮直接通向那里。

source: Nifro is open source under the MIT licence.
zh_hans: Nifro 以 MIT 许可开源。

source: Nifro lives in the menu bar, towards the right of the screen. Click its icon and choose “Add Website…” to get started. Use “Browsing Mode” when you need to log into a site or interact with it. Everything you do there is remembered, so you only have to sign in once. Not sure what to put up there? “Site Gallery…” in the same menu lists pages that work well as wallpapers, each with the settings that make it work.
zh_hans: Nifro 待在菜单栏靠右的位置。点它的图标，选“添加网站…”就可以开始了。 需要登录网站或者和它交互时，用“浏览模式”。在那里做的一切都会记住，所以只需登录一次。 不知道该放什么？同一个菜单里的“推荐站点…”列出了适合当壁纸的网页，每条都附带让它好用的设置。

source: No Playlist
zh_hans: 无播放列表

source: No Playlists
zh_hans: 没有播放列表

source: No page selected
zh_hans: 未选择网页

source: No Websites
zh_hans: 还没有网站

source: No internet connection
zh_hans: 没有网络连接

source: None
zh_hans: 无

source: Not a rule list
zh_hans: 不是规则列表

source: Not yet implemented.
zh_hans: 尚未实现。

source: Nothing left to clear
zh_hans: 已经没有可清的了

source: Nothing matches
zh_hans: 没有匹配的网站

source: OK
zh_hans: 好

source: Off while this Mac is on battery
zh_hans: 使用电池供电时已关闭

source: Only show at certain hours
zh_hans: 只在特定时段显示

source: Open Frame
zh_hans: 打开框架

source: Open Image
zh_hans: 打开图片

source: Open Link
zh_hans: 打开链接

source: Open Video
zh_hans: 打开视频

source: Open external links in default browser
zh_hans: 在默认浏览器中打开外部链接

source: Page opacity
zh_hans: 网页不透明度

source: Page reload interval
zh_hans: 网页自动刷新间隔

source: Find pages that work well as wallpapers. Adding one also applies its recommended settings.
zh_hans: 这里收录适合做壁纸的网页。添加时会一并应用推荐设置。

source: Password
zh_hans: 密码

source: Paste the address of a raw WebKit content-blocking `.json` file — the content-blocker projects publish them — and Nifro applies it to every website; ad blocking is the usual use.
zh_hans: 粘贴一个 WebKit 内容拦截 `.json` 原始文件的地址（内容拦截项目都有发布），Nifro 会把它应用到所有网站；常用于广告拦截等。

source: When paused, Nifro stops active work but still uses some memory.
zh_hans: 暂停时，Nifro 会停止活动任务，但仍会占用一些内存。

source: Permission
zh_hans: 授权

source: Playing sound
zh_hans: 正在发声

source: Playlist Actions
zh_hans: 播放列表操作

source: Playlists
zh_hans: 播放列表

source: Plays sound
zh_hans: 有声音

source: Please choose a directory that contains a “index.html” file.
zh_hans: 请选择一个含有「index.html」文件的目录。

source: Previous website
zh_hans: 上一个网站

source: Quit Nifro
zh_hans: 退出 Nifro

source: Random website
zh_hans: 随机一个网站

source: Region
zh_hans: 区域

source: Reload Website
zh_hans: 重新加载网站

source: Reload interval
zh_hans: 刷新间隔

source: Use a custom reload schedule
zh_hans: 使用此页面自己的刷新计划

source: Reload the page when the Mac wakes
zh_hans: Mac 唤醒时刷新网页

source: Reload website
zh_hans: 重新加载网站

source: Reloads the current website in Nifro.
zh_hans: 重新加载 Nifro 当前的网站。

source: Remove Websites
zh_hans: 移除网站

source: Remove websites ${websites}
zh_hans: 移除网站 ${websites}

source: Removes the given websites from Nifro.
zh_hans: 从 Nifro 中移除指定的网站。

source: Rename
zh_hans: 重命名

source: Rename Playlist
zh_hans: 重命名播放列表

source: Rename…
zh_hans: 重命名…

source: Restart Nifro to apply the language change?
zh_hans: 要重新启动 Nifro 以应用语言更改吗？

source: Restart Now
zh_hans: 立即重新启动

source: Report a Problem or Request a Feature…
zh_hans: 报告问题或提出需求…

source: Report a problem
zh_hans: 报告问题

source: Reset: every setting, every keyboard shortcut, and what each display is showing. Every display goes back to the default playlist and its first website. There is no undo. Kept: your websites and playlists, your logins, the language you picked, and whether Nifro launches at login.
zh_hans: 重置：所有设置、所有键盘快捷键，以及每个显示器正在显示的内容；每个显示器都会回到默认播放列表和它的第一个网站。无法撤销。 保留：你的网站和播放列表、你的登录状态、你选的语言，以及 Nifro 是否随登录启动。

source: Restore All Settings
zh_hans: 还原所有设置

source: Restore all settings?
zh_hans: 要还原所有设置吗？

source: Restore page position after reloading
zh_hans: 刷新后恢复页面位置

source: Returns the current website in Nifro.
zh_hans: 返回 Nifro 当前的网站。

source: Returns the websites in Nifro.
zh_hans: 返回 Nifro 里的网站列表。

source: Returns whether Nifro is currently enabled.
zh_hans: 返回 Nifro 当前是否启用。

source: Revert
zh_hans: 还原

source: Rotate in order
zh_hans: 按顺序轮播

source: Rotate randomly
zh_hans: 随机轮播

source: Search
zh_hans: 搜索

source: Search by name or address
zh_hans: 按名称或地址搜索

source: Select the directory “%@”.
zh_hans: 请选取“%@”这个文件夹。

source: Set Current Website
zh_hans: 设置当前网站

source: Set Enabled State
zh_hans: 设置启用状态

source: Set as Current
zh_hans: 设为当前

source: Set current website to ${website}
zh_hans: 把当前网站设为 ${website}

source: Sets the current website in Nifro to the given website.
zh_hans: 把 Nifro 的当前网站设为指定的网站。

source: Sets the enabled state of Nifro.
zh_hans: 设置 Nifro 的启用状态。

source: Settings…
zh_hans: 设置…

source: Shortcuts
zh_hans: 快捷键

source: Shortcuts act on the display the pointer is on.
zh_hans: 快捷键作用于鼠标位置所在显示器。

source: Show Menu Bar Icon
zh_hans: 显示菜单栏图标

source: Show Whole Page
zh_hans: 显示整页

source: Showing
zh_hans: 正在显示

source: Site Gallery
zh_hans: 推荐站点

source: Site Gallery…
zh_hans: 推荐站点…

source: Starts Nifro when you log in, so the wallpaper is already up when you reach the desktop.
zh_hans: 登录时自动启动 Nifro，你到桌面时壁纸已经在了。

source: Keep this page displayed
zh_hans: 固定显示此页面

source: Suggest a site…
zh_hans: 推荐网站…

source: Switch to Next Website
zh_hans: 切换到下一个网站

source: Switch to Previous Website
zh_hans: 切换到上一个网站

source: Switch to Random Website
zh_hans: 切换到随机一个网站

source: Switched off
zh_hans: 已关闭

source: Switches Nifro to a random website in the list.
zh_hans: 切换到列表里随机一个网站。

source: Switches Nifro to the next website in the list.
zh_hans: 切换到列表里的下一个网站。

source: Switches Nifro to the previous website in the list.
zh_hans: 切换到列表里的上一个网站。

source: When you unplug your Mac, Nifro hides every wallpaper and restores your desktop picture. It brings them back when you plug in again.
zh_hans: 拔掉电源后，Nifro 会隐藏所有网页壁纸并恢复桌面图片；重新接通电源后会自动恢复。

source: Shows only the video, so it fills the wallpaper without navigation, recommendations or comments.
zh_hans: 只显示视频本身，让它铺满壁纸，不显示导航、推荐和评论。

source: The built-in default playlist cannot be bound to a display, so duplicate it first and bind the copy.
zh_hans: 原生默认播放列表不可绑定显示器。请复制后再绑定。

source: The command “%@” is not supported.
zh_hans: 不支持“%@”这个命令。

source: The copy gets its own websites, so a region, a stylesheet or a reload interval changed in one list leaves the other alone. It does not copy logins: every site the original is signed in to, the copy is signed out of.
zh_hans: 副本会拿到属于它自己的网站，所以在一个列表里改缩放区域、样式表或刷新间隔，不会影响另一个。它不会复制登录状态：原列表已登录的每个网站，副本都是未登录的。

source: The default for websites that have not answered this themselves, in their own settings.
zh_hans: 没有在自己的设置里回答这个问题的网站，用这里的默认值。

source: The page is laid out at the size of the wallpaper, so `100vw` and `100vh` mean that area, and `<html>` carries `is-nifro-app` always and `nifro-is-browsing-mode` while Browsing Mode is on.
zh_hans: 页面按壁纸的大小排版，所以 `100vw`、`100vh` 指的就是那块区域；`<html>` 上一直有 `is-nifro-app`，浏览模式开着时还有 `nifro-is-browsing-mode`。

source: Nifro restores your wallpapers after restarting.
zh_hans: 重新启动后，Nifro 会自动恢复网页壁纸。

source: The websites Nifro comes with go into your default playlist, and a default playlist is made if you do not have one.
zh_hans: Nifro 自带的网站会进入你的默认播放列表；如果你没有默认播放列表，会新建一个。

source: This page did not load
zh_hans: 此页面未能载入

source: Title
zh_hans: 标题

source: Toggle
zh_hans: 切换

source: Toggle Browsing Mode
zh_hans: 切换浏览模式

source: Turn Nifro on or off
zh_hans: 打开或关闭 Nifro

source: Turn sound on or off
zh_hans: 打开或关闭声音

source: Toggles “Browsing Mode” for Nifro.
zh_hans: 切换 Nifro 的「浏览模式」。

source: Turn
zh_hans: 切换

source: URL
zh_hans: 网址

source: URL Host
zh_hans: 网址主机

source: URL to a rule list
zh_hans: 规则列表的网址

source: Until
zh_hans: 到

source: Up to date
zh_hans: 已是最新

source: Use print styles
zh_hans: 使用打印样式

source: Use Crop in the panel to choose which part of the page fills the wallpaper. Nifro remembers the position and zoom level.
zh_hans: 在面板中使用“裁切”选择网页的哪一部分铺满壁纸。Nifro 会记住位置和缩放级别。

source: Use the video-only page
zh_hans: 使用纯视频页面

source: Useful with rotation — a news page in the morning, something calmer at night; a window that runs past midnight, 22 to 6, works.
zh_hans: 配合轮换很好用——早上放新闻，晚上放安静点的；跨过午夜的时段（22 到 6）也可以。

source: Username
zh_hans: 用户名

source: Version %@
zh_hans: 版本 %@

source: Website
zh_hans: 网站

source: Websites
zh_hans: 网站

source: Welcome to Nifro!
zh_hans: 欢迎使用 Nifro！

source: When in dark mode
zh_hans: 深色模式下

source: Choose where links from this page open. Select “In Nifro” when you need to sign in or keep navigating within the same site.
zh_hans: 选择此页面中的链接在哪里打开。需要登录或继续浏览同一网站时，请选择“在 Nifro 中打开”。

source: Allow or mute this website's media. This controls audio and video elements, but not sound made with the Web Audio API.
zh_hans: 允许或静音此网站的媒体声音。它会控制页面中的音频和视频元素，但无法控制通过 Web Audio API 生成的声音。

source: Whole page
zh_hans: 整页

source: With this off, the colour only changes when the website does.
zh_hans: 关闭后，菜单栏颜色只在网站变化时才跟着变。

source: A nature film, a live camera, a map, a dashboard — anything a browser can draw.
zh_hans: 自然影片、实时摄像头、地图、仪表盘——浏览器画得出来的都行。

source: You will need to log in through Browsing Mode once.
zh_hans: 需要先用浏览模式登录一次。

source: Zoom In
zh_hans: 放大

source: Zoom Out
zh_hans: 缩小

source: ^[%lld site](inflect: true) · bundled copy, could not reach GitHub
zh_hans: %lld 个站点 · 内置副本，连不上 GitHub

source: ^[%lld site](inflect: true) · up to date with GitHub
zh_hans: %lld 个站点 · 已与 GitHub 同步

source: ^[%lld website](inflect: true)
zh_hans: %lld 个网站

source: by PathGao
zh_hans: 作者 PathGao

source: min
zh_hans: 分钟

source: sign-in
zh_hans: 需登录
